# RibbonItemEventArgs Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItemEventArgs Constructor
RibbonItemEventArgs Class See Also
---
Initializes a new instance of the RibbonItemEventArgs class
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RibbonItemEventArgs()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RibbonItemEventArgs()
```

# See Also
RibbonItemEventArgs Class
Autodesk.Revit.UI.Events Namespace